public class lesson_16_31 {
    //Методы типа Path

    //У интерфейса Path есть довольно много интересных методов. Самые интересные представлены в таблице ниже.
    //Метод	                                        Описание
    //Path getParent()                              Возвращает родительскую директорию
    //Path getFileName()                            Возвращает имя файла без директории
    //Path getRoot()                                Возвращает корневую директорию из пути
    //boolean isAbsolute()                          Проверяет, что текущий путь — абсолютный
    //Path toAbsolutePath()                         Преобразует путь в абсолютный
    //Path normalize()                              Убирает шаблоны в имени директории.
    //Path resolve(Path other)                      Строит новый абсолютный путь из абсолютного и относительного.
    //Path relativize(Path other)                   Получает относительный путь из двух абсолютных путей.
    //boolean startsWith(Path other)                Проверяет, что текущий путь начинается с пути
    //boolean endsWith(Path other)                  Проверяет, что текущий путь заканчивается на путь
    //int getNameCount()                            Дробит путь на части с помощью разделителя /. Возвращает количество частей.
    //Path getName(int index)                       Дробит путь на части с помощью разделителя /. Возвращает часть по ее номеру.
    //Path subpath(int beginIndex, int endIndex)    Дробит путь на части с помощью разделителя /. Возвращает часть пути, заданную интервалом.
    //File toFile()                                 Преобразует объект Path в устаревший объект File
    //URI toUri()                                   Преобразует объект Path в объект типа URI


}
